<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current Adobe Reader pkg and repackages, replacing a problematic preinstall script,
and enabling installation on non-boot volumes. Setting MAJOR_VERSION to "10" will cause a download of the
latest/last version of Adobe Reader 10, but the repackager is unlikely to operate properly with that version.
</string>
    <key>Identifier</key>
    <string>com.github.sggr57a.pkg.adobereader</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeReader</string>
        <key>LANGUAGE</key>
        <string>English</string>
        <key>MAJOR_VERSION</key>
        <string>11</string>
        <key>OS_VERSION</key>
        <string>10.8.0</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.AdobeReader</string>
    <key>Process</key>
    <array>
	<dict>
            <key>Processor</key>
            <string>AdobeReaderRepackager</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/expanded</string>
                <key>flat_pkg_path</key>
                <string>%pathname%/Adobe Reader XI Installer.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/expanded/application.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Adobe Reader.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
	<dict>
	    <key>Processor</key>
	    <string>PkgCopier</string>
	    <key>Arguments</key>
	    <dict>
		<key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Adobe Reader %version%.pkg</string>
                <key>source_pkg</key>
                <string>%pathname%/Adobe Reader XI Installer.pkg</string>
	    </dict>
	</dict>
    </array>
</dict>
</plist>
