<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Adobe's Creative Cloud Installer.</string>
	<key>Identifier</key>
	<string>com.github.rtrouton.download.AdobeCreativeCloudInstaller</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Creative Cloud Installer</string>
		<key>VENDOR</key>
		<string>Adobe</string>
		<key>SOFTWARETITLE</key>
		<string>Creative Cloud Installer</string>
		<key>NAMEWITHOUTSPACES</key>
		<string>CreativeCloudInstaller</string>
		<key>DOWNLOAD_URL</key>
		<string>https://ccmdls.adobe.com/AdobeProducts/KCCC/1/osx10/%NAMEWITHOUTSPACES%.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAMEWITHOUTSPACES%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%SOFTWARETITLE%.app</string>
				<key>requirement</key>
				<string>identifier "com.adobe.Install" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JQ525L2MZD</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/%SOFTWARETITLE%.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>

