<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Google Earth disk image and makes a pkg.</string>
    <key>Identifier</key>
    <string>com.github.sggr57a.pkg.google-earth</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleEarth</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.google-earth</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/expanded</string>
                <key>flat_pkg_path</key>
                <string>%pathname%/Install Google Earth*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/expanded/Google_Earth.pkg/Payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Google Earth.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
	<dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Google Earth %version%.pkg</string>
                <key>source_pkg</key>
                <string>%pathname%/Install Google Earth.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
