<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest MS Office 2011 installer, and uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.jss-recipes.jss.Office2011Update</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Testing</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.Office2011Updates</string>
	<key>Process</key>
	<array>
		<dict>
			<key>category</key>
			<string>%CATEGORY%</string>
			<key>prod_name</key>
			<string>%NAME%</string>
			<key>version</key>
			<string>%version%</string>
		</dict>
	</array>
</dict>
</plist>

