<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Silverlight installer and copies the package to the build directory with an appended version number.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.pkg.Silverlight</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Silverlight</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.Silverlight</string>
    <key>Process</key>
    <array>
	<dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Silverlight.pkg/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/unpack/root</string>
                <key>pkgdirs</key>
		<dict>
		    <key>Library</key>
		    <string>0755</string>
		    <key>Library/Internet Plug-Ins</key>
		    <string>0755</string>
		    <key>Library/Internet Plug-Ins/Silverlight.plugin</key>
		    <string>0755</string>
		    <key>Library/Application Support</key>
		    <string>0755</string>
		    <key>Library/Application Support/Microsoft</key>
		    <string>0755</string>
		    <key>Library/Application Support/Microsoft/Silverlight</key>
                    <string>0755</string>
		    <key>Library/Application Support/Microsoft/Silverlight/OutOfBrowser</key>
                    <string>0755</string>
		    <key>Library/Application Support/Microsoft/Silverlight/OutOfBrowser/SLLauncher.app</key>
                    <string>0755</string>
		</dict>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/silverlightplugin.pkg/Payload</string>
                <key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/unpack/root/Library</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
		<key>source_pkg</key>
                <string>%pathname%/Silverlight.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Silverlight %version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>

